#pragma once

#include <string>
#include <vector>
#include "sqlite3.h"
#include <fstream>

#include "Structs.h"

namespace MyTestFunctions {
	std::vector<Test> createTest()
	{
		std::vector<Test> tests;
		Test test;
		Test test1;
		Test test2;
		Test test3;

		test.setCategory("Математика");
		test.setSubCategory("Дискретна математика");

		Question q1 = { "Скiльки граней має куб?", {"4", "6", "8", "12"}, 2 };
		Question q2 = { "Яке число є парним?", {"15", "21", "28", "39"}, 3 };
		Question q3 = { "Яка формула для обчислення площi кола?", {"2Pir", "Pir^2",  "Pid", "4Pir^2"}, 2 };
		Question q4 = { "Яка формула для обчислення об'єму цилiндра?", {"2Pirh", "Pid^2h", "Pir^2h", "4/3Pir^3"}, 3 };
		Question q5 = { "Яка формула для обчислення площi трикутника?", {"a^2 + b^2 = c^2", "Pir^2", "4/3Pir^3", "1/2 * a * b"}, 4 };
		Question q6 = { "Яка формула для обчислення об'єму кулi?", {"4/3Pir^3", "Pir^2h", "2Pirh", "Pid^2h"}, 1 };
		Question q7 = { "Яка формула для обчислення площi прямокутника?", {"a * b", "2(a + b)", "a^2 + b^2 = c^2", "Pir^2"}, 1 };
		Question q8 = { "Яка формула для обчислення периметра квадрата?", { "2(a + b)", "4a", "a^2 + b^2 = c^2", "Pir^2"}, 2 };
		Question q9 = { "Яка формула для обчислення площi трапецiї?", {"(a + b)h/2", "a^2 + b^2 = c^2", "Pir^2", "4/3Pir^3"}, 1 };
		Question q10 = { "Яка формула для обчислення об'єму конуса?", {"2Pirh", "Pid^2h", "1/3Pir^2h", "4/3Pir^3"}, 3 };

		test.addQuestion(q1);
		test.addQuestion(q2);
		test.addQuestion(q3);
		test.addQuestion(q4);
		test.addQuestion(q5);
		test.addQuestion(q6);
		test.addQuestion(q7);
		test.addQuestion(q8);
		test.addQuestion(q9);
		test.addQuestion(q10);

		test1.setCategory("Математика");
		test1.setSubCategory("Математичний аналіз");

		Question q1_1 = { "Яка формула для обчислення похідної?", {"f'(x) = f(x) + h", "f'(x) = f(x) - h", "f'(x) = lim(h->0) (f(x+h) - f(x))/h",  "f'(x) = f(x) * h"}, 3 };
		Question q1_2 = { "Яка формула для обчислення інтегралу?", {"∫f(x)dx = f(x) + C", "∫f(x)dx = F(x) + C", "∫f(x)dx = f'(x) + C", "∫f(x)dx = f''(x) + C"}, 2 };
		Question q1_3 = { "Яка формула для обчислення границі?", {"lim(x->a) f(x) = L", "lim(x->a) f(x) = f(a)", "lim(x->a) f(x) = f'(a)", "lim(x->a) f(x) = f''(a)"}, 1 };
		Question q1_4 = { "Яка формула для обчислення ряду?", {"S = a1 * (1 - r)", "S = a1 + r", "S = a1 - r", "S = a1 / (1 - r)"}, 4 };
		Question q1_5 = { "Яка формула для обчислення похідної вищого порядку?", {"f''(x) = d^2f/dx^2", "f''(x) = df/dx", "f''(x) = f(x) + h", "f''(x) = f(x) - h"}, 1 };
		Question q1_6 = { "Яка формула для обчислення часткової похідної?", {"∂f/∂x = lim(h->0) (f(x+h,y) - f(x,y))/h", "∂f/∂x = f(x,y) + h", "∂f/∂x = f(x,y) - h", "∂f/∂x = f(x,y) * h"}, 1 };
		Question q1_7 = { "Яка формула для обчислення подвійного інтегралу?", {"∬f(x,y)dA = f(x,y) + C", "∬f(x,y)dA = F(x,y) + C", "∬f(x,y)dA = f'(x,y) + C", "∬f(x,y)dA = f''(x,y) + C"}, 2 };
		Question q1_8 = { "Яка формула для обчислення криволінійного інтегралу?", {"∫C f(x,y)ds = F(x,y) + C", "∫C f(x,y)ds = f(x,y) + C", "∫C f(x,y)ds = f'(x,y) + C", "∫C f(x,y)ds = f''(x,y) + C"}, 1 };
		Question q1_9 = { "Яка формула для обчислення ряду Фур'є?", {"f(x) ~ a0/2 + Σ (an cos(nx) + bn sin(nx))", "f(x) ~ a0 + Σ (an cos(nx) + bn sin(nx))", "f(x) ~ a0/2 + Σ (an sin(nx) + bn cos(nx))", "f(x) ~ a0 + Σ (an sin(nx) + bn cos(nx))"}, 1 };
		Question q1_10 = { "Яка формула для обчислення границі функції в точці?", {"lim(x->a) f(x) = f(a)", "lim(x->a) f(x) = f'(a)", "lim(x->a) f(x) = L",  "lim(x->a) f(x) = f''(a)"}, 3 };

		test1.addQuestion(q1_1);
		test1.addQuestion(q1_2);
		test1.addQuestion(q1_3);
		test1.addQuestion(q1_4);
		test1.addQuestion(q1_5);
		test1.addQuestion(q1_6);
		test1.addQuestion(q1_7);
		test1.addQuestion(q1_8);
		test1.addQuestion(q1_9);
		test1.addQuestion(q1_10);

		test2.setCategory("Фiзика");
		test2.setSubCategory("Механiка");

		Question q2_1 = { "Яка формула для обчислення швидкостi?", {"v = s/t", "v = at", "v = a + b", "v = s + t"}, 1 };
		Question q2_2 = { "Яка формула для обчислення прискорення?", {"a = s/v", "a = t/v", "a = v + t", "a = v/t",}, 4 };
		Question q2_3 = { "Яка формула для обчислення сили?", {"F = mv", "F = ma", "F = at", "F = s/t"}, 2 };
		Question q2_4 = { "Яка формула для обчислення роботи?", {"A = F / s", "A = F + s", "A = F * s", "A = F - s"}, 3 };
		Question q2_5 = { "Яка формула для обчислення енергiї?", {"E = F * s", "E = m * g", "E = m * a", "E = F / t"}, 1 };
		Question q2_6 = { "Яка формула для обчислення тиску?", {"P = F * S", "P = F / S", "P = S / F", "P = F + S"}, 2 };
		Question q2_7 = { "Яка формула для обчислення об'єму?", {"V = S * h", "V = S / h", "V = S + h", "V = S - h"}, 1 };
		Question q2_8 = { "Яка формула для обчислення густини?", {"d = V / m", "d = m + V", "d = m / V", "d = m - V"}, 3 };
		Question q2_9 = { "Яка формула для обчислення моменту сили?", {"M = F * r", "M = F / r", "M = F + r", "M = F - r"}, 1 };
		Question q2_10 = { "Яка формула для обчислення кутової швидкостi?", {"w = v * r", "w = v + r", "w = v - r", "w = v / r", }, 4 };

		test2.addQuestion(q2_1);
		test2.addQuestion(q2_2);
		test2.addQuestion(q2_3);
		test2.addQuestion(q2_4);
		test2.addQuestion(q2_5);
		test2.addQuestion(q2_6);
		test2.addQuestion(q2_7);
		test2.addQuestion(q2_8);
		test2.addQuestion(q2_9);
		test2.addQuestion(q2_10);

		test3.setCategory("Фiзика");
		test3.setSubCategory("Квантова фізика");

		Question q3_1 = { "Що таке квантова суперпозиція?", {"Стан, коли частинка знаходиться в одному визначеному стані", "Стан, коли частинка знаходиться в двох або більше станах одночасно", "Стан, коли частинка не має визначеного стану", "Стан, коли частинка рухається з надсвітловою швидкістю"}, 2 };
		Question q3_2 = { "Що таке квантове заплутування?", {"Явище, коли дві частинки мають незалежні стани", "Явище, коли дві частинки взаємодіють лише на короткі відстані", "Явище, коли стан однієї частинки залежить від стану іншої, незалежно від відстані між ними", "Явище, коли частинка рухається з надсвітловою швидкістю"}, 3 };
		Question q3_3 = { "Що таке принцип невизначеності Гейзенберга?", {"Принцип, що стверджує, що неможливо одночасно точно виміряти положення і імпульс частинки", "Принцип, що стверджує, що частинка може бути в двох місцях одночасно", "Принцип, що стверджує, що енергія частинки завжди позитивна", "Принцип, що стверджує, що частинка не має визначеного стану"}, 1 };
		Question q3_4 = { "Що таке хвильова функція?", {"Функція, що описує ймовірність знаходження частинки в певному стані", "Функція, що описує рух частинки в просторі", "Функція, що описує енергію частинки", "Функція, що описує імпульс частинки"}, 1 };
		Question q3_5 = { "Що таке квантова тунельна ефект?", {"Явище, коли частинка може проходити через потенціальний бар'єр, навіть якщо її енергія менша за висоту бар'єра", "Явище, коли частинка рухається з надсвітловою швидкістю", "Явище, коли частинка не має визначеного стану", "Явище, коли дві частинки взаємодіють лише на короткі відстані"}, 1 };
		Question q3_6 = { "Що таке квантова інтерференція?", {"Явище, коли хвилі частинок накладаються одна на одну, утворюючи зони посилення і послаблення", "Явище, коли частинка рухається з надсвітловою швидкістю", "Явище, коли частинка не має визначеного стану", "Явище, коли дві частинки взаємодіють лише на короткі відстані"}, 1 };
		Question q3_7 = { "Що таке квантова декогеренція?", {"Процес, при якому квантова система втрачає свою квантову природу і починає вести себе як класична система", "Процес, при якому частинка рухається з надсвітловою швидкістю", "Процес, при якому частинка не має визначеного стану", "Процес, при якому дві частинки взаємодіють лише на короткі відстані"}, 1 };
		Question q3_8 = { "Що таке квантова електродинаміка (КЕД)?", {"Теорія, що описує взаємодію електромагнітного поля з зарядженими частинками", "Теорія, що описує рух частинок в просторі", "Теорія, що описує енергію частинок", "Теорія, що описує імпульс частинок"}, 1 };
		Question q3_9 = { "Що таке квантова хромодинаміка (КХД)?", {"Теорія, що описує взаємодію кварків і глюонів", "Теорія, що описує рух частинок в просторі", "Теорія, що описує енергію частинок", "Теорія, що описує імпульс частинок"}, 1 };
		Question q3_10 = { "Що таке квантова гравітація?", {"Теорія, що намагається об'єднати квантову механіку і загальну теорію відносності", "Теорія, що описує рух частинок в просторі", "Теорія, що описує енергію частинок", "Теорія, що описує імпульс частинок"}, 1 };

		test3.addQuestion(q3_1);
		test3.addQuestion(q3_2);
		test3.addQuestion(q3_3);
		test3.addQuestion(q3_4);
		test3.addQuestion(q3_5);
		test3.addQuestion(q3_6);
		test3.addQuestion(q3_7);
		test3.addQuestion(q3_8);
		test3.addQuestion(q3_9);
		test3.addQuestion(q3_10);

		tests.push_back(test);
		tests.push_back(test1);
		tests.push_back(test2);
		tests.push_back(test3);

		return tests;
	};
}
